; ModuleID = 'server/egress.c'
source_filename = "server/egress.c"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpf"

%struct.anon.3 = type { [1 x i32]*, [10000 x i32]*, %struct.pkt_4tuple*, i32*, [1 x i32]* }
%struct.pkt_4tuple = type { i32, i32, i16, i16 }
%struct.__sk_buff = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [5 x i32], i32, i32, i32, i32, i32, i32, i32, i32, [4 x i32], [4 x i32], i32, i32, i32, %union.anon, i64, i32, i32, %union.anon.2 }
%union.anon = type { %struct.bpf_flow_keys* }
%struct.bpf_flow_keys = type { i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, %union.anon.0, i32, i32 }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [4 x i32], [4 x i32] }
%union.anon.2 = type { %struct.bpf_sock* }
%struct.bpf_sock = type { i32, i32, i32, i32, i32, i32, i32, [4 x i32], i32, i16, i16, i32, [4 x i32], i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, i32, i32 }
%struct.tcphdr = type { i16, i16, i32, i32, i16, i16, i16, i16 }

@key0 = dso_local local_unnamed_addr constant i32 858927408, align 4, !dbg !0
@key1 = dso_local local_unnamed_addr constant i32 1111570744, align 4, !dbg !72
@c0 = dso_local local_unnamed_addr constant i32 1886610805, align 4, !dbg !77
@c1 = dso_local local_unnamed_addr constant i32 1852075885, align 4, !dbg !79
@c2 = dso_local local_unnamed_addr constant i32 1852142177, align 4, !dbg !81

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "key0", scope: !2, file: !74, line: 38, type: !75, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !35, globals: !71, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "server/egress.c", directory: "/home/intro_cn/Downloads/xdp-router")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 40, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!9 = !DIEnumerator(name: "IPPROTO_IP", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4, isUnsigned: true)
!13 = !DIEnumerator(name: "IPPROTO_TCP", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "IPPROTO_EGP", value: 8, isUnsigned: true)
!15 = !DIEnumerator(name: "IPPROTO_PUP", value: 12, isUnsigned: true)
!16 = !DIEnumerator(name: "IPPROTO_UDP", value: 17, isUnsigned: true)
!17 = !DIEnumerator(name: "IPPROTO_IDP", value: 22, isUnsigned: true)
!18 = !DIEnumerator(name: "IPPROTO_TP", value: 29, isUnsigned: true)
!19 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33, isUnsigned: true)
!20 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41, isUnsigned: true)
!21 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46, isUnsigned: true)
!22 = !DIEnumerator(name: "IPPROTO_GRE", value: 47, isUnsigned: true)
!23 = !DIEnumerator(name: "IPPROTO_ESP", value: 50, isUnsigned: true)
!24 = !DIEnumerator(name: "IPPROTO_AH", value: 51, isUnsigned: true)
!25 = !DIEnumerator(name: "IPPROTO_MTP", value: 92, isUnsigned: true)
!26 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94, isUnsigned: true)
!27 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98, isUnsigned: true)
!28 = !DIEnumerator(name: "IPPROTO_PIM", value: 103, isUnsigned: true)
!29 = !DIEnumerator(name: "IPPROTO_COMP", value: 108, isUnsigned: true)
!30 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132, isUnsigned: true)
!31 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136, isUnsigned: true)
!32 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137, isUnsigned: true)
!33 = !DIEnumerator(name: "IPPROTO_RAW", value: 255, isUnsigned: true)
!34 = !DIEnumerator(name: "IPPROTO_MAX", value: 256, isUnsigned: true)
!35 = !{!36, !37, !38, !39, !64, !66, !69, !67}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!37 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!38 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !41, line: 86, size: 160, elements: !42)
!41 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "")
!42 = !{!43, !47, !48, !49, !54, !55, !56, !57, !58, !60, !63}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !40, file: !41, line: 88, baseType: !44, size: 4, flags: DIFlagBitField, extraData: i64 0)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !45, line: 21, baseType: !46)
!45 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!46 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !40, file: !41, line: 89, baseType: !44, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !40, file: !41, line: 96, baseType: !44, size: 8, offset: 8)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !40, file: !41, line: 97, baseType: !50, size: 16, offset: 16)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !51, line: 25, baseType: !52)
!51 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !45, line: 24, baseType: !53)
!53 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !40, file: !41, line: 98, baseType: !50, size: 16, offset: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !40, file: !41, line: 99, baseType: !50, size: 16, offset: 48)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !40, file: !41, line: 100, baseType: !44, size: 8, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !40, file: !41, line: 101, baseType: !44, size: 8, offset: 72)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !40, file: !41, line: 102, baseType: !59, size: 16, offset: 80)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !51, line: 31, baseType: !52)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !40, file: !41, line: 103, baseType: !61, size: 32, offset: 96)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !51, line: 27, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !45, line: 27, baseType: !7)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !40, file: !41, line: 104, baseType: !61, size: 32, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !65, line: 40, baseType: !53)
!65 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !68, line: 25, baseType: !64)
!68 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "")
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !68, line: 24, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !65, line: 38, baseType: !46)
!71 = !{!0, !72, !77, !79, !81, !83, !85, !91, !118, !126, !131, !138, !232, !237, !242}
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "key1", scope: !2, file: !74, line: 39, type: !75, isLocal: false, isDefinition: true)
!74 = !DIFile(filename: "server/../tools.h", directory: "/home/intro_cn/Downloads/xdp-router")
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!76 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "c0", scope: !2, file: !74, line: 40, type: !75, isLocal: false, isDefinition: true)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "c1", scope: !2, file: !74, line: 41, type: !75, isLocal: false, isDefinition: true)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "c2", scope: !2, file: !74, line: 42, type: !75, isLocal: false, isDefinition: true)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "c3", scope: !2, file: !74, line: 43, type: !75, isLocal: false, isDefinition: true)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 77, type: !87, isLocal: false, isDefinition: true)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 32, elements: !89)
!88 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!89 = !{!90}
!90 = !DISubrange(count: 4)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "array_map", scope: !2, file: !93, line: 26, type: !94, isLocal: false, isDefinition: true)
!93 = !DIFile(filename: "server/server.h", directory: "/home/intro_cn/Downloads/xdp-router")
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !93, line: 20, size: 320, elements: !95)
!95 = !{!96, !101, !106, !115, !117}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !94, file: !93, line: 21, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 32, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 1)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !94, file: !93, line: 22, baseType: !102, size: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 320000, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 10000)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !94, file: !93, line: 23, baseType: !107, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "map_key", file: !93, line: 17, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkt_4tuple", file: !93, line: 11, size: 96, elements: !110)
!110 = !{!111, !112, !113, !114}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !109, file: !93, line: 13, baseType: !7, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !109, file: !93, line: 14, baseType: !7, size: 32, offset: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !109, file: !93, line: 15, baseType: !53, size: 16, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !109, file: !93, line: 16, baseType: !53, size: 16, offset: 80)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !94, file: !93, line: 24, baseType: !116, size: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "pinning", scope: !94, file: !93, line: 25, baseType: !97, size: 64, offset: 256)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !120, line: 50, type: !121, isLocal: true, isDefinition: true)
!120 = !DIFile(filename: "/usr/include/bpf/bpf_helper_defs.h", directory: "")
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!36, !36, !124}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "bpf_probe_read_kernel", scope: !2, file: !120, line: 2751, type: !128, isLocal: true, isDefinition: true)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!37, !36, !62, !124}
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !120, line: 72, type: !133, isLocal: true, isDefinition: true)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!37, !36, !124, !124, !136}
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !45, line: 31, baseType: !137)
!137 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "bpf_l3_csum_replace", scope: !2, file: !120, line: 250, type: !140, isLocal: true, isDefinition: true)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!37, !143, !62, !136, !136, !136}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sk_buff", file: !145, line: 2974, size: 1408, elements: !146)
!145 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "")
!146 = !{!147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !163, !164, !165, !166, !167, !168, !169, !170, !171, !173, !174, !175, !176, !177, !209, !210, !211, !212}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !144, file: !145, line: 2975, baseType: !62, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !144, file: !145, line: 2976, baseType: !62, size: 32, offset: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !144, file: !145, line: 2977, baseType: !62, size: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !144, file: !145, line: 2978, baseType: !62, size: 32, offset: 96)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !144, file: !145, line: 2979, baseType: !62, size: 32, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !144, file: !145, line: 2980, baseType: !62, size: 32, offset: 160)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !144, file: !145, line: 2981, baseType: !62, size: 32, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !144, file: !145, line: 2982, baseType: !62, size: 32, offset: 224)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !144, file: !145, line: 2983, baseType: !62, size: 32, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !144, file: !145, line: 2984, baseType: !62, size: 32, offset: 288)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !144, file: !145, line: 2985, baseType: !62, size: 32, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tc_index", scope: !144, file: !145, line: 2986, baseType: !62, size: 32, offset: 352)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !144, file: !145, line: 2987, baseType: !160, size: 160, offset: 384)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 160, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 5)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !144, file: !145, line: 2988, baseType: !62, size: 32, offset: 544)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tc_classid", scope: !144, file: !145, line: 2989, baseType: !62, size: 32, offset: 576)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !144, file: !145, line: 2990, baseType: !62, size: 32, offset: 608)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !144, file: !145, line: 2991, baseType: !62, size: 32, offset: 640)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !144, file: !145, line: 2992, baseType: !62, size: 32, offset: 672)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !144, file: !145, line: 2995, baseType: !62, size: 32, offset: 704)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip4", scope: !144, file: !145, line: 2996, baseType: !62, size: 32, offset: 736)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip4", scope: !144, file: !145, line: 2997, baseType: !62, size: 32, offset: 768)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip6", scope: !144, file: !145, line: 2998, baseType: !172, size: 128, offset: 800)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 128, elements: !89)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip6", scope: !144, file: !145, line: 2999, baseType: !172, size: 128, offset: 928)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !144, file: !145, line: 3000, baseType: !62, size: 32, offset: 1056)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !144, file: !145, line: 3001, baseType: !62, size: 32, offset: 1088)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !144, file: !145, line: 3004, baseType: !62, size: 32, offset: 1120)
!177 = !DIDerivedType(tag: DW_TAG_member, scope: !144, file: !145, line: 3005, baseType: !178, size: 64, align: 64, offset: 1152)
!178 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !144, file: !145, line: 3005, size: 64, align: 64, elements: !179)
!179 = !{!180}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "flow_keys", scope: !178, file: !145, line: 3005, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_flow_keys", file: !145, line: 3555, size: 448, elements: !183)
!183 = !{!184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !207, !208}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nhoff", scope: !182, file: !145, line: 3556, baseType: !52, size: 16)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "thoff", scope: !182, file: !145, line: 3557, baseType: !52, size: 16, offset: 16)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "addr_proto", scope: !182, file: !145, line: 3558, baseType: !52, size: 16, offset: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "is_frag", scope: !182, file: !145, line: 3559, baseType: !44, size: 8, offset: 48)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_frag", scope: !182, file: !145, line: 3560, baseType: !44, size: 8, offset: 56)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "is_encap", scope: !182, file: !145, line: 3561, baseType: !44, size: 8, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ip_proto", scope: !182, file: !145, line: 3562, baseType: !44, size: 8, offset: 72)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "n_proto", scope: !182, file: !145, line: 3563, baseType: !50, size: 16, offset: 80)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !182, file: !145, line: 3564, baseType: !50, size: 16, offset: 96)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !182, file: !145, line: 3565, baseType: !50, size: 16, offset: 112)
!194 = !DIDerivedType(tag: DW_TAG_member, scope: !182, file: !145, line: 3566, baseType: !195, size: 256, offset: 128)
!195 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !182, file: !145, line: 3566, size: 256, elements: !196)
!196 = !{!197, !202}
!197 = !DIDerivedType(tag: DW_TAG_member, scope: !195, file: !145, line: 3567, baseType: !198, size: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !195, file: !145, line: 3567, size: 64, elements: !199)
!199 = !{!200, !201}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !198, file: !145, line: 3568, baseType: !61, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !198, file: !145, line: 3569, baseType: !61, size: 32, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, scope: !195, file: !145, line: 3571, baseType: !203, size: 256)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !195, file: !145, line: 3571, size: 256, elements: !204)
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !203, file: !145, line: 3572, baseType: !172, size: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !203, file: !145, line: 3573, baseType: !172, size: 128, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !182, file: !145, line: 3576, baseType: !62, size: 32, offset: 384)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "flow_label", scope: !182, file: !145, line: 3577, baseType: !61, size: 32, offset: 416)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !144, file: !145, line: 3006, baseType: !136, size: 64, offset: 1216)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "wire_len", scope: !144, file: !145, line: 3007, baseType: !62, size: 32, offset: 1280)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "gso_segs", scope: !144, file: !145, line: 3008, baseType: !62, size: 32, offset: 1312)
!212 = !DIDerivedType(tag: DW_TAG_member, scope: !144, file: !145, line: 3009, baseType: !213, size: 64, align: 64, offset: 1344)
!213 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !144, file: !145, line: 3009, size: 64, align: 64, elements: !214)
!214 = !{!215}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !213, file: !145, line: 3009, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_sock", file: !145, line: 3062, size: 608, elements: !218)
!218 = !{!219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "bound_dev_if", scope: !217, file: !145, line: 3063, baseType: !62, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !217, file: !145, line: 3064, baseType: !62, size: 32, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !217, file: !145, line: 3065, baseType: !62, size: 32, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !217, file: !145, line: 3066, baseType: !62, size: 32, offset: 96)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !217, file: !145, line: 3067, baseType: !62, size: 32, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !217, file: !145, line: 3068, baseType: !62, size: 32, offset: 160)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip4", scope: !217, file: !145, line: 3070, baseType: !62, size: 32, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip6", scope: !217, file: !145, line: 3071, baseType: !172, size: 128, offset: 224)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !217, file: !145, line: 3072, baseType: !62, size: 32, offset: 352)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !217, file: !145, line: 3073, baseType: !50, size: 16, offset: 384)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip4", scope: !217, file: !145, line: 3075, baseType: !62, size: 32, offset: 416)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip6", scope: !217, file: !145, line: 3076, baseType: !172, size: 128, offset: 448)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !217, file: !145, line: 3077, baseType: !62, size: 32, offset: 576)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "bpf_skb_store_bytes", scope: !2, file: !120, line: 221, type: !234, isLocal: true, isDefinition: true)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!37, !143, !62, !124, !62, !136}
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "bpf_clone_redirect", scope: !2, file: !120, line: 349, type: !239, isLocal: true, isDefinition: true)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!37, !143, !62, !136}
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "bpf_l4_csum_replace", scope: !2, file: !120, line: 286, type: !140, isLocal: true, isDefinition: true)
!244 = !{i32 7, !"Dwarf Version", i32 4}
!245 = !{i32 2, !"Debug Info Version", i32 3}
!246 = !{i32 1, !"wchar_size", i32 4}
!247 = !{!"clang version 10.0.0-4ubuntu1 "}
!248 = distinct !DISubprogram(name: "tc_egress", scope: !3, file: !3, line: 9, type: !249, scopeLine: 10, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !251)
!249 = !DISubroutineType(types: !250)
!250 = !{!76, !143}
!251 = !{!252, !253, !254, !255, !266, !267, !289, !290, !291, !292, !295, !298, !299, !300, !301, !302, !303, !304, !305, !307, !308, !310}
!252 = !DILocalVariable(name: "skb", arg: 1, scope: !248, file: !3, line: 9, type: !143)
!253 = !DILocalVariable(name: "data_end", scope: !248, file: !3, line: 11, type: !36)
!254 = !DILocalVariable(name: "data", scope: !248, file: !3, line: 12, type: !36)
!255 = !DILocalVariable(name: "eth", scope: !248, file: !3, line: 13, type: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !258, line: 163, size: 112, elements: !259)
!258 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "")
!259 = !{!260, !264, !265}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !257, file: !258, line: 164, baseType: !261, size: 48)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 48, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 6)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !257, file: !258, line: 165, baseType: !261, size: 48, offset: 48)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !257, file: !258, line: 166, baseType: !50, size: 16, offset: 96)
!266 = !DILocalVariable(name: "ip", scope: !248, file: !3, line: 16, type: !39)
!267 = !DILocalVariable(name: "tcp", scope: !248, file: !3, line: 19, type: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !270, line: 25, size: 160, elements: !271)
!270 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "")
!271 = !{!272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !269, file: !270, line: 26, baseType: !50, size: 16)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !269, file: !270, line: 27, baseType: !50, size: 16, offset: 16)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !269, file: !270, line: 28, baseType: !61, size: 32, offset: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !269, file: !270, line: 29, baseType: !61, size: 32, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !269, file: !270, line: 31, baseType: !52, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !269, file: !270, line: 32, baseType: !52, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !269, file: !270, line: 33, baseType: !52, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !269, file: !270, line: 34, baseType: !52, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !269, file: !270, line: 35, baseType: !52, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !269, file: !270, line: 36, baseType: !52, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !269, file: !270, line: 37, baseType: !52, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !269, file: !270, line: 38, baseType: !52, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !269, file: !270, line: 39, baseType: !52, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !269, file: !270, line: 40, baseType: !52, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !269, file: !270, line: 55, baseType: !50, size: 16, offset: 112)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !269, file: !270, line: 56, baseType: !59, size: 16, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !269, file: !270, line: 57, baseType: !50, size: 16, offset: 144)
!289 = !DILocalVariable(name: "key", scope: !248, file: !3, line: 21, type: !108)
!290 = !DILocalVariable(name: "ptr", scope: !248, file: !3, line: 23, type: !116)
!291 = !DILocalVariable(name: "delta", scope: !248, file: !3, line: 24, type: !7)
!292 = !DILocalVariable(name: "cksum_flags", scope: !293, file: !3, line: 33, type: !46)
!293 = distinct !DILexicalBlock(scope: !294, file: !3, line: 31, column: 5)
!294 = distinct !DILexicalBlock(scope: !248, file: !3, line: 25, column: 8)
!295 = !DILocalVariable(name: "pre_ack", scope: !296, file: !3, line: 41, type: !7)
!296 = distinct !DILexicalBlock(scope: !297, file: !3, line: 35, column: 9)
!297 = distinct !DILexicalBlock(scope: !293, file: !3, line: 34, column: 12)
!298 = !DILocalVariable(name: "old_ip_len_n", scope: !296, file: !3, line: 48, type: !67)
!299 = !DILocalVariable(name: "new_ip_len_n", scope: !296, file: !3, line: 49, type: !67)
!300 = !DILocalVariable(name: "data_end", scope: !296, file: !3, line: 53, type: !36)
!301 = !DILocalVariable(name: "data", scope: !296, file: !3, line: 54, type: !36)
!302 = !DILocalVariable(name: "eth", scope: !296, file: !3, line: 56, type: !256)
!303 = !DILocalVariable(name: "ip", scope: !296, file: !3, line: 57, type: !39)
!304 = !DILocalVariable(name: "tcp", scope: !296, file: !3, line: 58, type: !268)
!305 = !DILocalVariable(name: "old_flags_ptr", scope: !296, file: !3, line: 60, type: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!307 = !DILocalVariable(name: "new_flags_n", scope: !296, file: !3, line: 61, type: !53)
!308 = !DILocalVariable(name: "new_seq", scope: !309, file: !3, line: 68, type: !7)
!309 = distinct !DILexicalBlock(scope: !297, file: !3, line: 66, column: 9)
!310 = !DILabel(scope: !248, name: "DROP", file: !3, line: 73)
!311 = !DILocation(line: 0, scope: !248)
!312 = !DILocation(line: 11, column: 41, scope: !248)
!313 = !{!314, !315, i64 80}
!314 = !{!"__sk_buff", !315, i64 0, !315, i64 4, !315, i64 8, !315, i64 12, !315, i64 16, !315, i64 20, !315, i64 24, !315, i64 28, !315, i64 32, !315, i64 36, !315, i64 40, !315, i64 44, !316, i64 48, !315, i64 68, !315, i64 72, !315, i64 76, !315, i64 80, !315, i64 84, !315, i64 88, !315, i64 92, !315, i64 96, !316, i64 100, !316, i64 116, !315, i64 132, !315, i64 136, !315, i64 140, !316, i64 144, !318, i64 152, !315, i64 160, !315, i64 164, !316, i64 168}
!315 = !{!"int", !316, i64 0}
!316 = !{!"omnipotent char", !317, i64 0}
!317 = !{!"Simple C/C++ TBAA"}
!318 = !{!"long long", !316, i64 0}
!319 = !DILocation(line: 11, column: 30, scope: !248)
!320 = !DILocation(line: 11, column: 22, scope: !248)
!321 = !DILocation(line: 12, column: 37, scope: !248)
!322 = !{!314, !315, i64 76}
!323 = !DILocation(line: 12, column: 26, scope: !248)
!324 = !DILocation(line: 12, column: 18, scope: !248)
!325 = !DILocation(line: 13, column: 26, scope: !248)
!326 = !DILocation(line: 14, column: 12, scope: !327)
!327 = distinct !DILexicalBlock(scope: !248, file: !3, line: 14, column: 8)
!328 = !DILocation(line: 14, column: 25, scope: !327)
!329 = !DILocation(line: 14, column: 8, scope: !248)
!330 = !DILocation(line: 15, column: 13, scope: !331)
!331 = distinct !DILexicalBlock(scope: !248, file: !3, line: 15, column: 8)
!332 = !{!333, !334, i64 12}
!333 = !{!"ethhdr", !316, i64 0, !316, i64 6, !334, i64 12}
!334 = !{!"short", !316, i64 0}
!335 = !DILocation(line: 15, column: 20, scope: !331)
!336 = !DILocation(line: 15, column: 8, scope: !248)
!337 = !DILocation(line: 17, column: 10, scope: !338)
!338 = distinct !DILexicalBlock(scope: !248, file: !3, line: 17, column: 8)
!339 = !DILocation(line: 17, column: 23, scope: !338)
!340 = !DILocation(line: 17, column: 22, scope: !338)
!341 = !DILocation(line: 17, column: 8, scope: !248)
!342 = !DILocation(line: 18, column: 12, scope: !343)
!343 = distinct !DILexicalBlock(scope: !248, file: !3, line: 18, column: 8)
