; ModuleID = 'switch/switch.c'
source_filename = "switch/switch.c"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpf"

%struct.anon = type { [1 x i32]*, [100 x i32]*, i32*, i32* }
%struct.anon.0 = type { [2 x i32]*, [4096 x i32]*, i32*, i32* }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }

@key0 = dso_local local_unnamed_addr constant i32 858927408, align 4, !dbg !0
@key1 = dso_local local_unnamed_addr constant i32 1111570744, align 4, !dbg !50
@c0 = dso_local local_unnamed_addr constant i32 1886610805, align 4, !dbg !55
@c1 = dso_local local_unnamed_addr constant i32 1852075885, align 4, !dbg !57
@c2 = dso_local local_unnamed_addr constant i32 1852142177, align 4, !dbg !59
@c3 = dso_local local_unnamed_addr constant i32 2037671283, align 4, !dbg !61
@MAX_INT = dso_local local_unnamed_addr constant i32 4096, align 4, !dbg !63
@total_bit = dso_local local_unnamed_addr constant i32 131072, align 4, !dbg !66
@MAX_ENTRY = dso_local local_unnamed_addr constant i32 100, align 4, !dbg !68
@__const.ingress.____fmt = private unnamed_addr constant [12 x i8] c"Client SYN\0A\00", align 1
@__const.ingress.____fmt.1 = private unnamed_addr constant [15 x i8] c"source ip: %d\0A\00", align 1
@__const.ingress.____fmt.2 = private unnamed_addr constant [13 x i8] c"dest ip: %d\0A\00", align 1
@__const.ingress.____fmt.3 = private unnamed_addr constant [17 x i8] c"source port: %d\0A\00", align 1

!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "XDP_TX", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4, isUnsigned: true)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 40, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!17 = !DIEnumerator(name: "IPPROTO_IP", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4, isUnsigned: true)
!21 = !DIEnumerator(name: "IPPROTO_TCP", value: 6, isUnsigned: true)
!22 = !DIEnumerator(name: "IPPROTO_EGP", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "IPPROTO_PUP", value: 12, isUnsigned: true)
!24 = !DIEnumerator(name: "IPPROTO_UDP", value: 17, isUnsigned: true)
!25 = !DIEnumerator(name: "IPPROTO_IDP", value: 22, isUnsigned: true)
!26 = !DIEnumerator(name: "IPPROTO_TP", value: 29, isUnsigned: true)
!27 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33, isUnsigned: true)
!28 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41, isUnsigned: true)
!29 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46, isUnsigned: true)
!30 = !DIEnumerator(name: "IPPROTO_GRE", value: 47, isUnsigned: true)
!31 = !DIEnumerator(name: "IPPROTO_ESP", value: 50, isUnsigned: true)
!32 = !DIEnumerator(name: "IPPROTO_AH", value: 51, isUnsigned: true)
!33 = !DIEnumerator(name: "IPPROTO_MTP", value: 92, isUnsigned: true)
!34 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94, isUnsigned: true)
!35 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98, isUnsigned: true)
!36 = !DIEnumerator(name: "IPPROTO_PIM", value: 103, isUnsigned: true)
!37 = !DIEnumerator(name: "IPPROTO_COMP", value: 108, isUnsigned: true)
!38 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132, isUnsigned: true)
!39 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136, isUnsigned: true)
!40 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137, isUnsigned: true)
!41 = !DIEnumerator(name: "IPPROTO_RAW", value: 255, isUnsigned: true)
!42 = !DIEnumerator(name: "IPPROTO_MAX", value: 256, isUnsigned: true)
!43 = !{!44, !45, !46, !7}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!45 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !47, line: 40, baseType: !48)
!47 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!48 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!49 = !{!0, !50, !55, !57, !59, !61, !63, !66, !68, !70, !76, !96, !113, !123, !134, !143, !148, !153}
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "key1", scope: !2, file: !52, line: 40, type: !53, isLocal: false, isDefinition: true)
!52 = !DIFile(filename: "switch/../tools.h", directory: "/home/intro_cn/Downloads/xdp-router")
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "c0", scope: !2, file: !52, line: 41, type: !53, isLocal: false, isDefinition: true)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "c1", scope: !2, file: !52, line: 42, type: !53, isLocal: false, isDefinition: true)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "c2", scope: !2, file: !52, line: 43, type: !53, isLocal: false, isDefinition: true)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "c3", scope: !2, file: !52, line: 44, type: !53, isLocal: false, isDefinition: true)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "MAX_INT", scope: !2, file: !65, line: 10, type: !53, isLocal: false, isDefinition: true)
!65 = !DIFile(filename: "switch/../bloom.h", directory: "/home/intro_cn/Downloads/xdp-router")
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "total_bit", scope: !2, file: !65, line: 11, type: !53, isLocal: false, isDefinition: true)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "MAX_ENTRY", scope: !2, file: !3, line: 5, type: !53, isLocal: false, isDefinition: true)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 92, type: !72, isLocal: false, isDefinition: true)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 32, elements: !74)
!73 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!74 = !{!75}
!75 = !DISubrange(count: 4)
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(name: "bloom_filter", scope: !2, file: !65, line: 24, type: !78, isLocal: false, isDefinition: true)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !65, line: 19, size: 256, elements: !79)
!79 = !{!80, !85, !90, !95}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !78, file: !65, line: 20, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 64, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 2)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !78, file: !65, line: 21, baseType: !86, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 131072, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 4096)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !78, file: !65, line: 22, baseType: !91, size: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !93, line: 26, baseType: !94)
!93 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "")
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !47, line: 42, baseType: !7)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !78, file: !65, line: 23, baseType: !91, size: 64, offset: 192)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "hash_map", scope: !2, file: !3, line: 14, type: !98, isLocal: false, isDefinition: true)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 8, size: 256, elements: !99)
!99 = !{!100, !105, !110, !112}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !98, file: !3, line: 10, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 32, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 1)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !98, file: !3, line: 11, baseType: !106, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 3200, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 100)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !98, file: !3, line: 12, baseType: !111, size: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !98, file: !3, line: 13, baseType: !111, size: 64, offset: 192)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !115, line: 171, type: !116, isLocal: true, isDefinition: true)
!115 = !DIFile(filename: "/usr/include/bpf/bpf_helper_defs.h", directory: "")
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!45, !119, !121, null}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !122, line: 27, baseType: !7)
!122 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "bpf_csum_diff", scope: !2, file: !115, line: 783, type: !125, isLocal: true, isDefinition: true)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!128, !130, !121, !130, !121, !133}
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !122, line: 30, baseType: !129)
!129 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !132, line: 27, baseType: !121)
!132 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !132, line: 32, baseType: !121)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !115, line: 72, type: !136, isLocal: true, isDefinition: true)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!45, !44, !139, !139, !141}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !122, line: 31, baseType: !142)
!142 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !115, line: 50, type: !145, isLocal: true, isDefinition: true)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!44, !44, !139}
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "bpf_probe_read_kernel", scope: !2, file: !115, line: 2751, type: !150, isLocal: true, isDefinition: true)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!45, !44, !121, !139}
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "bpf_map_delete_elem", scope: !2, file: !115, line: 82, type: !155, isLocal: true, isDefinition: true)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!45, !44, !139}
!158 = !{i32 7, !"Dwarf Version", i32 4}
!159 = !{i32 2, !"Debug Info Version", i32 3}
!160 = !{i32 1, !"wchar_size", i32 4}
!161 = !{!"clang version 10.0.0-4ubuntu1 "}
!162 = distinct !DISubprogram(name: "Jenkins", scope: !65, file: !65, line: 64, type: !163, scopeLine: 65, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !165)
!163 = !DISubroutineType(types: !164)
!164 = !{!92, !92}
!165 = !{!166, !167}
!166 = !DILocalVariable(name: "key", arg: 1, scope: !162, file: !65, line: 64, type: !92)
!167 = !DILocalVariable(name: "hash", scope: !162, file: !65, line: 66, type: !92)
!168 = !DILocation(line: 0, scope: !162)
!169 = !DILocation(line: 67, column: 10, scope: !162)
!170 = !DILocation(line: 68, column: 19, scope: !162)
!171 = !DILocation(line: 68, column: 10, scope: !162)
!172 = !DILocation(line: 69, column: 10, scope: !162)
!173 = !DILocation(line: 70, column: 19, scope: !162)
!174 = !DILocation(line: 70, column: 10, scope: !162)
!175 = !DILocation(line: 71, column: 10, scope: !162)
!176 = !DILocation(line: 72, column: 5, scope: !162)
!177 = distinct !DISubprogram(name: "ingress", scope: !3, file: !3, line: 17, type: !178, scopeLine: 18, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !188)
!178 = !DISubroutineType(types: !179)
!179 = !{!54, !180}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 3164, size: 160, elements: !182)
!182 = !{!183, !184, !185, !186, !187}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !181, file: !6, line: 3165, baseType: !121, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !181, file: !6, line: 3166, baseType: !121, size: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !181, file: !6, line: 3167, baseType: !121, size: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !181, file: !6, line: 3169, baseType: !121, size: 32, offset: 96)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !181, file: !6, line: 3170, baseType: !121, size: 32, offset: 128)
!188 = !{!189, !190, !191, !192, !206, !224, !246, !255, !260, !265, !270, !272, !273, !274, !275, !276, !279, !285, !290, !292, !293}
!189 = !DILocalVariable(name: "ctx", arg: 1, scope: !177, file: !3, line: 17, type: !180)
!190 = !DILocalVariable(name: "data", scope: !177, file: !3, line: 19, type: !44)
!191 = !DILocalVariable(name: "data_end", scope: !177, file: !3, line: 20, type: !44)
!192 = !DILocalVariable(name: "eth", scope: !177, file: !3, line: 21, type: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !195, line: 163, size: 112, elements: !196)
!195 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "")
!196 = !{!197, !202, !203}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !194, file: !195, line: 164, baseType: !198, size: 48)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 48, elements: !200)
!199 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!200 = !{!201}
!201 = !DISubrange(count: 6)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !194, file: !195, line: 165, baseType: !198, size: 48, offset: 48)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !194, file: !195, line: 166, baseType: !204, size: 16, offset: 96)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !132, line: 25, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !122, line: 24, baseType: !48)
!206 = !DILocalVariable(name: "ip", scope: !177, file: !3, line: 24, type: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !209, line: 86, size: 160, elements: !210)
!209 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "")
!210 = !{!211, !213, !214, !215, !216, !217, !218, !219, !220, !222, !223}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !208, file: !209, line: 88, baseType: !212, size: 4, flags: DIFlagBitField, extraData: i64 0)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !122, line: 21, baseType: !199)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !208, file: !209, line: 89, baseType: !212, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !208, file: !209, line: 96, baseType: !212, size: 8, offset: 8)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !208, file: !209, line: 97, baseType: !204, size: 16, offset: 16)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !208, file: !209, line: 98, baseType: !204, size: 16, offset: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !208, file: !209, line: 99, baseType: !204, size: 16, offset: 48)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !208, file: !209, line: 100, baseType: !212, size: 8, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !208, file: !209, line: 101, baseType: !212, size: 8, offset: 72)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !208, file: !209, line: 102, baseType: !221, size: 16, offset: 80)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !132, line: 31, baseType: !205)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !208, file: !209, line: 103, baseType: !131, size: 32, offset: 96)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !208, file: !209, line: 104, baseType: !131, size: 32, offset: 128)
!224 = !DILocalVariable(name: "tcp", scope: !177, file: !3, line: 27, type: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !227, line: 25, size: 160, elements: !228)
!227 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "")
!228 = !{!229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !226, file: !227, line: 26, baseType: !204, size: 16)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !226, file: !227, line: 27, baseType: !204, size: 16, offset: 16)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !226, file: !227, line: 28, baseType: !131, size: 32, offset: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !226, file: !227, line: 29, baseType: !131, size: 32, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !226, file: !227, line: 31, baseType: !205, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !226, file: !227, line: 32, baseType: !205, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !226, file: !227, line: 33, baseType: !205, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !226, file: !227, line: 34, baseType: !205, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !226, file: !227, line: 35, baseType: !205, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !226, file: !227, line: 36, baseType: !205, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !226, file: !227, line: 37, baseType: !205, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !226, file: !227, line: 38, baseType: !205, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !226, file: !227, line: 39, baseType: !205, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !226, file: !227, line: 40, baseType: !205, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !226, file: !227, line: 55, baseType: !204, size: 16, offset: 112)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !226, file: !227, line: 56, baseType: !221, size: 16, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !226, file: !227, line: 57, baseType: !204, size: 16, offset: 144)
!246 = !DILocalVariable(name: "____fmt", scope: !247, file: !3, line: 33, type: !252)
!247 = distinct !DILexicalBlock(scope: !248, file: !3, line: 33, column: 13)
!248 = distinct !DILexicalBlock(scope: !249, file: !3, line: 32, column: 9)
!249 = distinct !DILexicalBlock(scope: !250, file: !3, line: 31, column: 12)
!250 = distinct !DILexicalBlock(scope: !251, file: !3, line: 30, column: 5)
!251 = distinct !DILexicalBlock(scope: !177, file: !3, line: 29, column: 8)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 96, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 12)
!255 = !DILocalVariable(name: "____fmt", scope: !256, file: !3, line: 34, type: !257)
!256 = distinct !DILexicalBlock(scope: !248, file: !3, line: 34, column: 13)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 120, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 15)
!260 = !DILocalVariable(name: "____fmt", scope: !261, file: !3, line: 35, type: !262)
!261 = distinct !DILexicalBlock(scope: !248, file: !3, line: 35, column: 13)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 104, elements: !263)
!263 = !{!264}
!264 = !DISubrange(count: 13)
!265 = !DILocalVariable(name: "____fmt", scope: !266, file: !3, line: 36, type: !267)
!266 = distinct !DILexicalBlock(scope: !248, file: !3, line: 36, column: 13)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 136, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 17)
!270 = !DILocalVariable(name: "____fmt", scope: !271, file: !3, line: 37, type: !257)
!271 = distinct !DILexicalBlock(scope: !248, file: !3, line: 37, column: 13)
!272 = !DILocalVariable(name: "hash", scope: !250, file: !3, line: 39, type: !7)
!273 = !DILocalVariable(name: "flag_ptr", scope: !250, file: !3, line: 45, type: !111)
!274 = !DILocalVariable(name: "bflag", scope: !250, file: !3, line: 47, type: !7)
!275 = !DILocalVariable(name: "aflag", scope: !250, file: !3, line: 49, type: !7)
!276 = !DILocalVariable(name: "hash", scope: !277, file: !3, line: 56, type: !7)
!277 = distinct !DILexicalBlock(scope: !278, file: !3, line: 55, column: 5)
!278 = distinct !DILexicalBlock(scope: !251, file: !3, line: 54, column: 13)
!279 = !DILocalVariable(name: "____fmt", scope: !280, file: !3, line: 61, type: !262)
!280 = distinct !DILexicalBlock(scope: !281, file: !3, line: 61, column: 17)
!281 = distinct !DILexicalBlock(scope: !282, file: !3, line: 60, column: 13)
!282 = distinct !DILexicalBlock(scope: !283, file: !3, line: 59, column: 16)
!283 = distinct !DILexicalBlock(scope: !284, file: !3, line: 58, column: 9)
!284 = distinct !DILexicalBlock(scope: !277, file: !3, line: 57, column: 12)
!285 = !DILocalVariable(name: "____fmt", scope: !286, file: !3, line: 62, type: !287)
!286 = distinct !DILexicalBlock(scope: !281, file: !3, line: 62, column: 17)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 112, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 14)
!290 = !DILocalVariable(name: "seq", scope: !291, file: !3, line: 70, type: !7)
!291 = distinct !DILexicalBlock(scope: !284, file: !3, line: 69, column: 9)
!292 = !DILocalVariable(name: "ptr", scope: !291, file: !3, line: 70, type: !111)
!293 = !DILocalVariable(name: "____fmt", scope: !294, file: !3, line: 86, type: !296)
!294 = distinct !DILexicalBlock(scope: !295, file: !3, line: 86, column: 9)
!295 = distinct !DILexicalBlock(scope: !278, file: !3, line: 85, column: 5)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 56, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 7)
!299 = !DILocation(line: 0, scope: !177)
!300 = !DILocation(line: 19, column: 34, scope: !177)
!301 = !{!302, !303, i64 0}
!302 = !{!"xdp_md", !303, i64 0, !303, i64 4, !303, i64 8, !303, i64 12, !303, i64 16}
!303 = !{!"int", !304, i64 0}
!304 = !{!"omnipotent char", !305, i64 0}
