; ModuleID = 'switch/switch.c'
source_filename = "switch/switch.c"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpf"

%struct.anon = type { [1 x i32]*, [100 x i32]*, i32*, i32* }
%struct.anon.0 = type { [2 x i32]*, [4096 x i32]*, i32*, i32* }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, i32, i32 }
%struct.tcphdr = type { i16, i16, i32, i32, i16, i16, i16, i16 }

@key0 = dso_local local_unnamed_addr constant i32 858927408, align 4, !dbg !0
@key1 = dso_local local_unnamed_addr constant i32 1111570744, align 4, !dbg !50
@c0 = dso_local local_unnamed_addr constant i32 1886610805, align 4, !dbg !55
@c1 = dso_local local_unnamed_addr constant i32 1852075885, align 4, !dbg !57
@c2 = dso_local local_unnamed_addr constant i32 1852142177, align 4, !dbg !59
@c3 = dso_local local_unnamed_addr constant i32 2037671283, align 4, !dbg !61
@MAX_INT = dso_local local_unnamed_addr constant i32 4096, align 4, !dbg !63
@total_bit = dso_local local_unnamed_addr constant i32 131072, align 4, !dbg !66
@MAX_ENTRY = dso_local local_unnamed_addr constant i32 100, align 4, !dbg !68
@hash_map = dso_local global %struct.anon zeroinitializer, section ".maps", align 8, !dbg !96
@bloom_filter = dso_local global %struct.anon.0 zeroinitializer, section ".maps", align 8, !dbg !76
@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !70

!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "XDP_TX", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4, isUnsigned: true)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 40, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!17 = !DIEnumerator(name: "IPPROTO_IP", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4, isUnsigned: true)
!21 = !DIEnumerator(name: "IPPROTO_TCP", value: 6, isUnsigned: true)
!22 = !DIEnumerator(name: "IPPROTO_EGP", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "IPPROTO_PUP", value: 12, isUnsigned: true)
!24 = !DIEnumerator(name: "IPPROTO_UDP", value: 17, isUnsigned: true)
!25 = !DIEnumerator(name: "IPPROTO_IDP", value: 22, isUnsigned: true)
!26 = !DIEnumerator(name: "IPPROTO_TP", value: 29, isUnsigned: true)
!27 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33, isUnsigned: true)
!28 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41, isUnsigned: true)
!29 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46, isUnsigned: true)
!30 = !DIEnumerator(name: "IPPROTO_GRE", value: 47, isUnsigned: true)
!31 = !DIEnumerator(name: "IPPROTO_ESP", value: 50, isUnsigned: true)
!32 = !DIEnumerator(name: "IPPROTO_AH", value: 51, isUnsigned: true)
!33 = !DIEnumerator(name: "IPPROTO_MTP", value: 92, isUnsigned: true)
!34 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94, isUnsigned: true)
!35 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98, isUnsigned: true)
!36 = !DIEnumerator(name: "IPPROTO_PIM", value: 103, isUnsigned: true)
!37 = !DIEnumerator(name: "IPPROTO_COMP", value: 108, isUnsigned: true)
!38 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132, isUnsigned: true)
!39 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136, isUnsigned: true)
!40 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137, isUnsigned: true)
!41 = !DIEnumerator(name: "IPPROTO_RAW", value: 255, isUnsigned: true)
!42 = !DIEnumerator(name: "IPPROTO_MAX", value: 256, isUnsigned: true)
!43 = !{!44, !45, !46, !7}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!45 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !47, line: 40, baseType: !48)
!47 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!48 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!49 = !{!0, !50, !55, !57, !59, !61, !63, !66, !68, !70, !76, !96, !113, !124, !129, !135}
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "key1", scope: !2, file: !52, line: 39, type: !53, isLocal: false, isDefinition: true)
!52 = !DIFile(filename: "switch/../tools.h", directory: "/home/intro_cn/Downloads/xdp-router")
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "c0", scope: !2, file: !52, line: 40, type: !53, isLocal: false, isDefinition: true)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "c1", scope: !2, file: !52, line: 41, type: !53, isLocal: false, isDefinition: true)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "c2", scope: !2, file: !52, line: 42, type: !53, isLocal: false, isDefinition: true)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "c3", scope: !2, file: !52, line: 43, type: !53, isLocal: false, isDefinition: true)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "MAX_INT", scope: !2, file: !65, line: 10, type: !53, isLocal: false, isDefinition: true)
!65 = !DIFile(filename: "switch/../bloom.h", directory: "/home/intro_cn/Downloads/xdp-router")
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "total_bit", scope: !2, file: !65, line: 11, type: !53, isLocal: false, isDefinition: true)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "MAX_ENTRY", scope: !2, file: !3, line: 4, type: !53, isLocal: false, isDefinition: true)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 69, type: !72, isLocal: false, isDefinition: true)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 32, elements: !74)
!73 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!74 = !{!75}
!75 = !DISubrange(count: 4)
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(name: "bloom_filter", scope: !2, file: !65, line: 24, type: !78, isLocal: false, isDefinition: true)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !65, line: 19, size: 256, elements: !79)
!79 = !{!80, !85, !90, !95}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !78, file: !65, line: 20, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 64, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 2)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !78, file: !65, line: 21, baseType: !86, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 131072, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 4096)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !78, file: !65, line: 22, baseType: !91, size: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !93, line: 26, baseType: !94)
!93 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "")
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !47, line: 42, baseType: !7)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !78, file: !65, line: 23, baseType: !91, size: 64, offset: 192)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "hash_map", scope: !2, file: !3, line: 13, type: !98, isLocal: false, isDefinition: true)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 7, size: 256, elements: !99)
!99 = !{!100, !105, !110, !112}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !98, file: !3, line: 9, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 32, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 1)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !98, file: !3, line: 10, baseType: !106, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 3200, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 100)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !98, file: !3, line: 11, baseType: !111, size: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !98, file: !3, line: 12, baseType: !111, size: 64, offset: 192)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !115, line: 72, type: !116, isLocal: true, isDefinition: true)
!115 = !DIFile(filename: "/usr/include/bpf/bpf_helper_defs.h", directory: "")
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!45, !44, !119, !119, !121}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !122, line: 31, baseType: !123)
!122 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!123 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !115, line: 50, type: !126, isLocal: true, isDefinition: true)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!44, !44, !119}
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "bpf_probe_read_kernel", scope: !2, file: !115, line: 2751, type: !131, isLocal: true, isDefinition: true)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!45, !44, !134, !119}
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !122, line: 27, baseType: !7)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "bpf_map_delete_elem", scope: !2, file: !115, line: 82, type: !137, isLocal: true, isDefinition: true)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!45, !44, !119}
!140 = !{i32 7, !"Dwarf Version", i32 4}
!141 = !{i32 2, !"Debug Info Version", i32 3}
!142 = !{i32 1, !"wchar_size", i32 4}
!143 = !{!"clang version 10.0.0-4ubuntu1 "}
!144 = distinct !DISubprogram(name: "Jenkins", scope: !65, file: !65, line: 64, type: !145, scopeLine: 65, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !147)
!145 = !DISubroutineType(types: !146)
!146 = !{!92, !92}
!147 = !{!148, !149}
!148 = !DILocalVariable(name: "key", arg: 1, scope: !144, file: !65, line: 64, type: !92)
!149 = !DILocalVariable(name: "hash", scope: !144, file: !65, line: 66, type: !92)
!150 = !DILocation(line: 0, scope: !144)
!151 = !DILocation(line: 67, column: 10, scope: !144)
!152 = !DILocation(line: 68, column: 19, scope: !144)
!153 = !DILocation(line: 68, column: 10, scope: !144)
!154 = !DILocation(line: 69, column: 10, scope: !144)
!155 = !DILocation(line: 70, column: 19, scope: !144)
!156 = !DILocation(line: 70, column: 10, scope: !144)
!157 = !DILocation(line: 71, column: 10, scope: !144)
!158 = !DILocation(line: 72, column: 5, scope: !144)
!159 = distinct !DISubprogram(name: "ingress", scope: !3, file: !3, line: 16, type: !160, scopeLine: 17, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !170)
!160 = !DISubroutineType(types: !161)
!161 = !{!54, !162}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 3164, size: 160, elements: !164)
!164 = !{!165, !166, !167, !168, !169}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !163, file: !6, line: 3165, baseType: !134, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !163, file: !6, line: 3166, baseType: !134, size: 32, offset: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !163, file: !6, line: 3167, baseType: !134, size: 32, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !163, file: !6, line: 3169, baseType: !134, size: 32, offset: 96)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !163, file: !6, line: 3170, baseType: !134, size: 32, offset: 128)
!170 = !{!171, !172, !173, !174, !189, !208, !230, !231, !237}
!171 = !DILocalVariable(name: "ctx", arg: 1, scope: !159, file: !3, line: 16, type: !162)
!172 = !DILocalVariable(name: "data", scope: !159, file: !3, line: 18, type: !44)
!173 = !DILocalVariable(name: "data_end", scope: !159, file: !3, line: 19, type: !44)
!174 = !DILocalVariable(name: "eth", scope: !159, file: !3, line: 20, type: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !177, line: 163, size: 112, elements: !178)
!177 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "")
!178 = !{!179, !184, !185}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !176, file: !177, line: 164, baseType: !180, size: 48)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 48, elements: !182)
!181 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!182 = !{!183}
!183 = !DISubrange(count: 6)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !176, file: !177, line: 165, baseType: !180, size: 48, offset: 48)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !176, file: !177, line: 166, baseType: !186, size: 16, offset: 96)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !187, line: 25, baseType: !188)
!187 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !122, line: 24, baseType: !48)
!189 = !DILocalVariable(name: "ip", scope: !159, file: !3, line: 23, type: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !192, line: 86, size: 160, elements: !193)
!192 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "")
!193 = !{!194, !196, !197, !198, !199, !200, !201, !202, !203, !205, !207}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !191, file: !192, line: 88, baseType: !195, size: 4, flags: DIFlagBitField, extraData: i64 0)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !122, line: 21, baseType: !181)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !191, file: !192, line: 89, baseType: !195, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !191, file: !192, line: 96, baseType: !195, size: 8, offset: 8)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !191, file: !192, line: 97, baseType: !186, size: 16, offset: 16)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !191, file: !192, line: 98, baseType: !186, size: 16, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !191, file: !192, line: 99, baseType: !186, size: 16, offset: 48)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !191, file: !192, line: 100, baseType: !195, size: 8, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !191, file: !192, line: 101, baseType: !195, size: 8, offset: 72)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !191, file: !192, line: 102, baseType: !204, size: 16, offset: 80)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !187, line: 31, baseType: !188)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !191, file: !192, line: 103, baseType: !206, size: 32, offset: 96)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !187, line: 27, baseType: !134)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !191, file: !192, line: 104, baseType: !206, size: 32, offset: 128)
!208 = !DILocalVariable(name: "tcp", scope: !159, file: !3, line: 26, type: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !211, line: 25, size: 160, elements: !212)
!211 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "")
!212 = !{!213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !210, file: !211, line: 26, baseType: !186, size: 16)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !210, file: !211, line: 27, baseType: !186, size: 16, offset: 16)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !210, file: !211, line: 28, baseType: !206, size: 32, offset: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !210, file: !211, line: 29, baseType: !206, size: 32, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !210, file: !211, line: 31, baseType: !188, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !210, file: !211, line: 32, baseType: !188, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !210, file: !211, line: 33, baseType: !188, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !210, file: !211, line: 34, baseType: !188, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !210, file: !211, line: 35, baseType: !188, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !210, file: !211, line: 36, baseType: !188, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !210, file: !211, line: 37, baseType: !188, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !210, file: !211, line: 38, baseType: !188, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !210, file: !211, line: 39, baseType: !188, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !210, file: !211, line: 40, baseType: !188, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !210, file: !211, line: 55, baseType: !186, size: 16, offset: 112)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !210, file: !211, line: 56, baseType: !204, size: 16, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !210, file: !211, line: 57, baseType: !186, size: 16, offset: 144)
!230 = !DILocalVariable(name: "hash", scope: !159, file: !3, line: 28, type: !7)
!231 = !DILocalVariable(name: "seq", scope: !232, file: !3, line: 48, type: !7)
!232 = distinct !DILexicalBlock(scope: !233, file: !3, line: 47, column: 9)
!233 = distinct !DILexicalBlock(scope: !234, file: !3, line: 41, column: 12)
!234 = distinct !DILexicalBlock(scope: !235, file: !3, line: 40, column: 5)
!235 = distinct !DILexicalBlock(scope: !236, file: !3, line: 39, column: 13)
!236 = distinct !DILexicalBlock(scope: !159, file: !3, line: 29, column: 8)
!237 = !DILocalVariable(name: "ptr", scope: !232, file: !3, line: 48, type: !111)
!238 = !DILocation(line: 0, scope: !159)
!239 = !DILocation(line: 18, column: 34, scope: !159)
!240 = !{!241, !242, i64 0}
!241 = !{!"xdp_md", !242, i64 0, !242, i64 4, !242, i64 8, !242, i64 12, !242, i64 16}
!242 = !{!"int", !243, i64 0}
!243 = !{!"omnipotent char", !244, i64 0}
!244 = !{!"Simple C/C++ TBAA"}
!245 = !DILocation(line: 18, column: 23, scope: !159)
!246 = !DILocation(line: 18, column: 16, scope: !159)
!247 = !DILocation(line: 19, column: 38, scope: !159)
!248 = !{!241, !242, i64 4}
!249 = !DILocation(line: 19, column: 27, scope: !159)
!250 = !DILocation(line: 20, column: 24, scope: !159)
!251 = !DILocation(line: 21, column: 11, scope: !252)
!252 = distinct !DILexicalBlock(scope: !159, file: !3, line: 21, column: 8)
!253 = !DILocation(line: 21, column: 25, scope: !252)
!254 = !DILocation(line: 21, column: 24, scope: !252)
!255 = !DILocation(line: 21, column: 8, scope: !159)
!256 = !DILocation(line: 22, column: 13, scope: !257)
!257 = distinct !DILexicalBlock(scope: !159, file: !3, line: 22, column: 8)
!258 = !{!259, !260, i64 12}
!259 = !{!"ethhdr", !243, i64 0, !243, i64 6, !260, i64 12}
!260 = !{!"short", !243, i64 0}
!261 = !DILocation(line: 22, column: 20, scope: !257)
!262 = !DILocation(line: 22, column: 8, scope: !159)
!263 = !DILocation(line: 24, column: 10, scope: !264)
!264 = distinct !DILexicalBlock(scope: !159, file: !3, line: 24, column: 8)
!265 = !DILocation(line: 24, column: 23, scope: !264)
!266 = !DILocation(line: 24, column: 22, scope: !264)
!267 = !DILocation(line: 24, column: 8, scope: !159)
!268 = !DILocation(line: 25, column: 12, scope: !269)
!269 = distinct !DILexicalBlock(scope: !159, file: !3, line: 25, column: 8)
!270 = !{!271, !243, i64 9}
!271 = !{!"iphdr", !243, i64 0, !243, i64 0, !243, i64 1, !260, i64 2, !260, i64 4, !260, i64 6, !243, i64 8, !243, i64 9, !260, i64 10, !242, i64 12, !242, i64 16}
!272 = !DILocation(line: 25, column: 20, scope: !269)
!273 = !DILocation(line: 25, column: 8, scope: !159)
!274 = !DILocation(line: 27, column: 11, scope: !275)
!275 = distinct !DILexicalBlock(scope: !159, file: !3, line: 27, column: 8)
!276 = !DILocation(line: 27, column: 25, scope: !275)
!277 = !DILocation(line: 27, column: 24, scope: !275)
!278 = !DILocation(line: 27, column: 8, scope: !159)
!279 = !DILocation(line: 28, column: 5, scope: !159)
!280 = !DILocation(line: 28, column: 29, scope: !159)
!281 = !{!271, !242, i64 12}
!282 = !DILocation(line: 28, column: 39, scope: !159)
!283 = !{!271, !242, i64 16}
!284 = !DILocation(line: 28, column: 50, scope: !159)
!285 = !{!286, !260, i64 0}
!286 = !{!"tcphdr", !260, i64 0, !260, i64 2, !242, i64 4, !242, i64 8, !260, i64 12, !260, i64 12, !260, i64 13, !260, i64 13, !260, i64 13, !260, i64 13, !260, i64 13, !260, i64 13, !260, i64 13, !260, i64 13, !260, i64 14, !260, i64 16, !260, i64 18}
!287 = !DILocation(line: 28, column: 62, scope: !159)
!288 = !{!286, !260, i64 2}
!289 = !DILocalVariable(name: "src", arg: 1, scope: !290, file: !52, line: 49, type: !7)
!290 = distinct !DISubprogram(name: "cookie_gen", scope: !52, file: !52, line: 49, type: !291, scopeLine: 50, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !293)
